README.org
#+STARTUP: overview
My Personal emacs configs for note-taking workflow, coding, managing daily agenda, composing documents, presentations in latex, managing bibtex files, emails and much much more. 
* Interface Tweaks
** Startup General Settings
#+BEGIN_SRC emacs-lisp
;; Remove initial buffer, set index file
(setq inhibit-startup-message t)
(setq initial-buffer-choice "~/Dropbox/org/agenda/TODOs.org")

;; Hide Scroll bar,menu bar, tool bar
(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)

;; Line numbering
(global-display-line-numbers-mode)
(setq display-line-numbers-type 'relative)

;; Display battery for when in full screen mode
;; Uncomment in laptops
(display-battery-mode -1)

;; Misc stuff
(fset 'yes-or-no-p 'y-or-n-p)
(setenv "HOME" "/home/alkhaldieid/")
(server-start)

;; show paranthasis
(show-paren-mode 1)
;;set the default font"
;;(set-default-font "Ubuntu Mono-25")
(global-visual-line-mode t)

#+END_SRC

#+RESULTS:
: t

* Org Mode Stuff
** org setup
#+BEGIN_SRC emacs-lisp
  (use-package org
    :ensure t)
  (defun package-config ()
    (unless (package-installed-p 'org-plus-contrib)
      (package-refresh-contents)
      (package-install 'org-plus-contrib)))
  (add-hook 'after-init-hook 'package-config)
#+END_SRC
** Aesthetics, customizations
#+BEGIN_SRC emacs-lisp
  (use-package org-superstar  ;; Improved version of org-bullets
    :ensure t
    :config
    (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))

  (setq org-startup-indented t)           ;; Indent according to section
  (setq org-startup-with-inline-images t) ;; Display images in-buffer by default
#+END_SRC

** Evil-org for evil-mode integration
This is very fancy, it treats org-mode elements (i.e. sections, source blocks, tables)
as regular text objects ( 'ae' object ). Additionally, it allows reordering stuff using
M-j, M-k, M-l and M-h instead of the regular M-<arrow keys>.
Operators that deal with indentation ( < and > ) also indent headers.
#+BEGIN_SRC emacs-lisp
(use-package evil-org
  :ensure t
  :after (evil org)
  :config
  (add-hook 'org-mode-hook 'evil-org-mode)
  (add-hook 'evil-org-mode-hook
            (lambda ()
              (evil-org-set-key-theme '(navigation insert textobjects additional calendar))))
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+END_SRC

** Org-agenda
#+BEGIN_SRC emacs-lisp
(use-package org-projectile
:ensure t)       
(setq org-agenda-custom-commands
   '(("h" "Daily habits"
      ((agenda ""))
      ((org-agenda-show-log t)
       (org-agenda-ndays 7)
       (org-agenda-log-mode-items '(state))
       (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp ":DAILY:"))))))
(setq org-todo-keywords
    (quote ((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
            (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING" "TBC(b)"))))

(setq org-todo-keyword-faces
    (quote (("TODO" :foreground "red" :weight bold)
            ("NEXT" :foreground "blue" :weight bold)
            ("DONE" :foreground "forest green" :weight bold)
            ("TBC" :foreground "forest green" :weight bold)
            ("WAITING" :foreground "orange" :weight bold)
            ("HOLD" :foreground "magenta" :weight bold)
            ("CANCELLED" :foreground "forest green" :weight bold)
            ("email" :foreground "forest green" :weight bold)
            ("PHONE" :foreground "forest green" :weight bold))))
(setq org-use-fast-todo-selection t)

;; capturing templates
(setq org-capture-templates
    '(("n" "New Idea" entry (file "~/Dropbox/org/agenda/newpaperideas.org")
        "* %? :IDEA: \n%t" :clock-in t :clock-resume t)
    ("f" "Fancy" entry (file "~/Dropbox/org/roam/20201017010543-fancy.org")
        "* %? :fancy: \n%t" :clock-in nil :clock-resume nil)
    ("p" "research" entry (file "~/Dropbox/org/agenda/research.org")
        "* %? :research:todo: \n%t" :clock-in nil :clock-resume nil)
    ("a" "alias" entry (file "~/.config/aliasrc")
        "* %? \n" )
    ("c" "coding goal" entry (file "~/Dropbox/org/agenda/coding.org")
        "* %? :goal: \n%t" :clock-in nil :clock-resume nil)
    ("t" "TODO item" entry (file "~/Dropbox/org/agenda/TODOs.org")
        "* %? :goal: \n%t" :clock-in nil :clock-resume nil)
    ("r" "to be refiled" entry (file "~/Dropbox/org/agenda/refile.org")
        "* %? :misc: \n%t" :clock-in nil :clock-resume nil)))
(global-set-key (kbd "<f5>") 'org-capture)
(global-set-key (kbd "<f12>") 'org-agenda)


;; The following setting is different from the document so that you
;; can override the document org-agenda-files by setting your
;; org-agenda-files in the variable org-user-agenda-files
;;
(if (boundp 'org-user-agenda-files)
    (setq org-agenda-files org-user-agenda-files)
(setq org-agenda-files (quote ("~/Dropbox/org/roam/daily"
                                "~/Dropbox/org/agenda/"
                                ))))

(with-eval-after-load 'org-agenda
(require 'org-projectile)
(mapcar #'(lambda (file)
            (when (file-exists-p file)
                (push file org-agenda-files)))
        (org-projectile-todo-files)))
#+END_SRC

#+RESULTS:

** Org-babel
#+BEGIN_SRC emacs-lisp
(require 'ob-ipython)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)
   (ipython . t)
   (lisp . t)))
#+END_SRC

** Configs
#+BEGIN_SRC emacs-lisp :output no
;; disables the automatic indentation inside an orgmode source block when invoking evil-org-open-below with <normal-state> o
(setq org-src-tab-acts-natively nil)

#+END_SRC

#+RESULTS:
: complete

