README.org
** setting variables for note-taking
#+BEGIN_SRC emacs-lisp
(setq
 org_notes (concat (getenv "HOME") "Dropbox/org/roam/")
 zot_bib (concat (getenv "HOME") "Dropbox/mend/library.bib")
 org-directory org_notes
 deft-directory org_notes
 org-roam-directory org_notes
 )
(require 'org-ref)

(setq
      org-ref-completion-library 'org-ref-ivy-cite
      org-ref-get-pdf-filename-function 'org-ref-get-pdf-filename-helm-bibtexy
      org-ref-default-bibliography (list "/home/alkhaldieid/Dropbox/mend/library.bib")
      org-ref-bibliography-notes "/home/alkhaldieid/Dropbox/org/roam/bibnotes.org"
      org-ref-note-title-format "* TODO %y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :NOTER_DOCUMENT: %F\n :ROAM_KEY: cite:%k\n  :AUTHOR: %9a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n"
      org-ref-notes-directory "/home/alkhaldieid/Dropbox/org/roam/"
      org-ref-notes-function 'orb-edit-notes
)
;;;;;;;;;;; Spacemacs configs;;;;



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;; NOTE TAKING CONFIGS ;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(setq
   dropbox_dir (concat (getenv "HOME") "/Dropbox")
   org_notes (concat dropbox_dir "/org/roam/")
   zot_bib (concat dropbox_dir "/mend/library.bib")
   org-directory org_notes
   deft-directory org_notes
   org-roam-directory org_notes
   agenda_dir (concat dropbox_dir "/org/agenda")
)
(with-eval-after-load 'org
    (setq
    bibtex-completion-notes-path org_notes
    bibtex-completion-bibliography zot_bib
    bibtex-completion-pdf-field "file"
    bibtex-completion-notes-template-multiple-files
    (concat
      "#+TITLE: ${title}\n"
      "#+ROAM_KEY: cite:${=key=}\n"
      "* TODO Notes\n"
      ":PROPERTIES:\n"
      ":Custom_ID: ${=key=}\n"
      ":NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
      ":AUTHOR: ${author-abbrev}\n"
      ":JOURNAL: ${journaltitle}\n"
      ":DATE: ${date}\n"
      ":YEAR: ${year}\n"
      ":DOI: ${doi}\n"
      ":URL: ${url}\n"
      ":END:\n\n"
      "* Why am I reading this article?\n"
      "* Problem Definition\n"
      "* Proposed Method\n"
      "* Dataset used\n"

     )
  )
)
;;;;;;;;;;;; ORG NOTER ;;;;;;;;;;;;;;;;;;;;;;;;;

(with-eval-after-load 'org
   (setq
            org-ref-completion-library 'org-ref-ivy-cite
            org-ref-get-pdf-filename-function 'org-ref-get-mendeley-filename
            org-ref-default-bibliography (list zot_bib)
            org-ref-bibliography-files (list zot_bib)
            org-ref-bibliography-notes (concat org_notes  "/bibnotes.org")
            org-ref-note-title-format "* TODO %y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :NOTER_DOCUMENT: %F\n :ROAM_KEY: cite:%k\n  :AUTHOR: %9a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n"
            org-ref-notes-directory org_notes
            org-ref-notes-function 'orb-edit-notes
        )
      (setq
            org-noter-default-notes-file-name '(concat dropbox_dir "/notes.org")
            org-noter-default-search-path  '(concat dropbox_dir "/mend"))

  )
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;; LaTex Configurations;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ;; org settings

  (setq user-full-name "Eid Alkhaldi")
  (require 'ox)
  (require 'ox-latex)

  (setq org-latex-pdf-process '("%latex -interaction nonstopmode -output-directory %o %f" "%latex -interaction nonstopmode -output-directory %o %f" "latex -interaction nonstopmode -output-directory %o %f" ))
  (setq org-latex-create-formula-image-program 'dvipng)
  (org-babel-do-load-languages 'org-babel-load-languages '((latex . t)))
  (with-eval-after-load 'org-agenda
    (require 'org-projectile)
    (mapcar #'(lambda (file)
                (when (file-exists-p file)
                  (push file org-agenda-files)))
            (org-projectile-todo-files)))
  (global-company-mode)
  (menu-bar-mode 1)
  (global-visual-line-mode t)
  ;(add-to-list 'deft-extensions "tex")
   ;;; enables the live-preview of compiled pdfs
  (add-hook 'doc-view-mode-hook 'auto-revert-mode)
  (org-babel-do-load-languages 'org-babel-load-languages '((python . t)))
;;;;; form
  (with-eval-after-load 'org
      (add-to-list 'org-latex-classes
                  '("apa6"
                    "\\documentclass{apa6}"
                    ("\\section{%s}" . "\\section*{%s}")
                    ("\\subsection{%s}" . "\\subsection*{%s}")
                    ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                    ("\\paragraph{%s}" . "\\paragraph*{%s}")
                    ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
      (setq org-latex-pdf-process
            '("latexmk -pdflatex='pdflatex -interaction nonstopmode' -pdf -bibtex -f %f")))


;;;;;;;;;;;;;;;;;;;;;;;;;; My functions ;;;;;;;;;;;;;;;;;;
  (defun my-org-screenshot ()
    "Take a screenshot into a time stamped unique-named file in the
same directory as the org-buffer and insert a link to this file."
    (interactive)
    (setq filename
          (concat
           (make-temp-name
            (concat (buffer-file-name)
                    "_"
                    (format-time-string "%Y%m%d_%H%M%S_")) ) ".png"))
    (call-process "import" nil nil nil filename)
    (insert (concat "[[" filename "]]"))
    (org-display-inline-images))



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;; Organizational stuff ;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; following this guy
  (setq org-todo-keywords
        (quote ((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
                (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING" "TBC(b)"))))

  (setq org-todo-keyword-faces
        (quote (("TODO" :foreground "red" :weight bold)
                ("NEXT" :foreground "blue" :weight bold)
                ("DONE" :foreground "forest green" :weight bold)
                ("TBC" :foreground "forest green" :weight bold)
                ("WAITING" :foreground "orange" :weight bold)
                ("HOLD" :foreground "magenta" :weight bold)
                ("CANCELLED" :foreground "forest green" :weight bold)
                ("MEETING" :foreground "forest green" :weight bold)
                ("PHONE" :foreground "forest green" :weight bold))))
  (setq org-use-fast-todo-selection t)

  ;; capturing templates
  (setq org-capture-templates
        '(("n" "New Idea" entry (file "~/Dropbox/org/agenda/newpaperideas.org")
           "* %? :IDEA: \n%t" :clock-in t :clock-resume t)
           ))



  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;;;;;;;;;;;;;;;;;;;;;; Apperance ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (setq evil-emacs-state-cursor '("chartreuse3" (box)))
  (setq-default evil-insert-state-cursor 'box)

  (setq org-startup-folded "folded")

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;; company confiuration ;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (setq company-minimum-prefix-length 3
       company-idle-delay 0.05)
;;;;;;;;;;;;;


#+END_SRC

#+RESULTS:
: 0.05
** Latex
org-plus-contrib package includes the ox.extra.el which is used to activate the ignore-headlines function which enables us to ignore heading when exporting to latex
#+BEGIN_SRC emacs-lisp 
  (with-eval-after-load 'org
    (add-to-list 'org-latex-classes
                 '("thesis"
                   "\\documentclass[12pt]{uthesis-v12}"
                   ("\\chapter{%s}" . "\\chapter*{%s}")
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ))
    
    (add-to-list 'org-latex-classes
                 '("altacv" "\\documentclass[10pt,a4paper,ragged2e,withhyper]{altacv}
  
  % Change the page layout if you need to
  \\geometry{left=1.25cm,right=1.25cm,top=1.5cm,bottom=1.5cm,columnsep=1.2cm}
  
  % Use roboto and lato for fonts
  \\renewcommand{\\familydefault}{\\sfdefault}
  
  % Change the colours if you want to
  \\definecolor{SlateGrey}{HTML}{2E2E2E}
  \\definecolor{LightGrey}{HTML}{666666}
  \\definecolor{DarkPastelRed}{HTML}{450808}
  \\definecolor{PastelRed}{HTML}{8F0D0D}
  \\definecolor{GoldenEarth}{HTML}{E7D192}
  \\colorlet{name}{black}
  \\colorlet{tagline}{PastelRed}
  \\colorlet{heading}{DarkPastelRed}
  \\colorlet{headingrule}{GoldenEarth}
  \\colorlet{subheading}{PastelRed}
  \\colorlet{accent}{PastelRed}
  \\colorlet{emphasis}{SlateGrey}
  \\colorlet{body}{LightGrey}
  
  % Change some fonts, if necessary
  \\renewcommand{\\namefont}{\\Huge\\rmfamily\\bfseries}
  \\renewcommand{\\personalinfofont}{\\footnotesize}
  \\renewcommand{\\cvsectionfont}{\\LARGE\\rmfamily\\bfseries}
  \\renewcommand{\\cvsubsectionfont}{\\large\\bfseries}
  
  % Change the bullets for itemize and rating marker
  % for \cvskill if you want to
  \\renewcommand{\\itemmarker}{{\\small\\textbullet}}
  \\renewcommand{\\ratingmarker}{\\faCircle}
  "
  
                   ("\\cvsection{%s}" . "\\cvsection*{%s}")
                   ("\\cvevent{%s}" . "\\cvevent*{%s}"))))
#+END_SRC

#+RESULTS:
| altacv | \documentclass[10pt,a4paper,ragged2e,withhyper]{altacv} |

* Evil mode stuff
#+BEGIN_SRC emacs-lisp
(use-package powerline-evil
  :ensure t)
(powerline-evil-vim-theme)
(powerline-evil-vim-color-theme)
(use-package evil-commentary
  :ensure t)
(evil-commentary-mode)

#+END_SRC

#+RESULTS:
: t

* Theming & Aesthethic
** themes
#+BEGIN_SRC emacs-lisp
  (global-hl-line-mode t) ;; This highlights the current line in the buffer
  (use-package beacon ;; This applies a beacon effect to the highlighted line
     :ensure t
     :config
     (beacon-mode 1))
;; a bunch of nice themes

  (use-package dracula-theme :ensure t)
  (use-package parchment-theme :ensure t)
  (use-package cloud-theme :ensure t)
  (use-package moe-theme :ensure t)
  (use-package zenburn-theme :ensure t)
  (use-package monokai-theme :ensure t)
  (use-package gruvbox-theme :ensure t)
  (use-package ample-theme :ensure t)
  (use-package ample-zen-theme :ensure t)
  (use-package alect-themes :ensure t)
  (use-package tao-theme :ensure t)
  (use-package poet-theme :ensure t)
  (use-package modus-operandi-theme :ensure t)
  (use-package modus-vivendi-theme :ensure t)
  (use-package faff-theme :ensure t)
  (use-package color-theme-modern :ensure t)

  (load-theme 'modus-vivendi t)
#+END_SRC

#+RESULTS:
: t
** fonts
set the font size 100/10 = 10pts
for more info go to this website
#+BEGIN_SRC emacs-lisp
(set-face-attribute 'default nil :height 120)
#+END_SRC

#+RESULTS:

* MISC Packages
** Try
#+BEGIN_SRC emacs-lisp
(use-package try
  :ensure t)
#+END_SRC

** Which-key
#+BEGIN_SRC emacs-lisp
(use-package which-key
  :config
    (setq which-key-idle-delay 0.3)
    (setq which-key-popup-type 'frame)
    (which-key-mode)
    (which-key-setup-minibuffer)
    (set-face-attribute 'which-key-local-map-description-face nil
       :weight 'bold)
  :ensure t)
#+END_SRC
** Helm for navigation                                       
#+BEGIN_SRC emacs-lisp :tangle no
(use-package helm
  :init
    (require 'helm-config)
    (setq helm-split-window-in-side-p t
          helm-move-to-line-cycle-in-source t)
  :config
    (helm-mode 1) ;; Most of Emacs prompts become helm-enabled
    (helm-autoresize-mode 1) ;; Helm resizes according to the number of candidates
    (global-set-key (kbd "C-x b") 'helm-buffers-list) ;; List buffers ( Emacs way )
    (define-key evil-ex-map "b" 'helm-buffers-list) ;; List buffers ( Vim way )
    (global-set-key (kbd "C-x r b") 'helm-bookmarks) ;; Bookmarks menu
    (global-set-key (kbd "C-x C-f") 'helm-find-files) ;; Finding files with Helm
    (global-set-key (kbd "M-c") 'helm-calcul-expression) ;; Use Helm for calculations
    (global-set-key (kbd "C-s") 'helm-occur)  ;; Replaces the default isearch keybinding
    (global-set-key (kbd "C-h a") 'helm-apropos)  ;; Helmized apropos interface
    (global-set-key (kbd "M-x") 'helm-M-x)  ;; Improved M-x menu
    (global-set-key (kbd "M-y") 'helm-show-kill-ring)  ;; Show kill ring, pick something to paste
  :ensure t)
#+END_SRC
