README.org
** Org mode
#+BEGIN_SRC emacs-lisp
(define-skeleton org-latex-summary
"Skeleton for summaries "
"Preamble:"
"#+LATEX_CLASS: article\n"
"#+LATEX_CLASS_OPTIONS: [a5paper,landscape,fourcolumn]\n"
"#+LATEX_COMPILER: lualatex\n"
"#+LATEX_HEADER: \\input{/home/trajanus/Documents/LaTeX/summaryheader.tex}\n"
"#+STARTUP: showeverything\n"
"#+OPTIONS: toc:nil\n"
"\\begin{multicols*}{4}\n"
"* "_"\n"
"\\end{multicols*}\n")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(define-skeleton org-latex-article
"Skeleton for articles "
"Preamble:"
"#+STARTUP: showeverything\n"
"#+TITLE: TITLE\n"
"#+AUTHOR: Eid Alkhaldi\n"
"#+DATE: \\today\n"
"#+LATEX_CLASS: article\n"
"#+LATEX_CLASS_OPTIONS: [a4paper]\n"
"#+LATEX_HEADER: \\input{/home/alkhaldieid/Dropbox/LaTeX/articleheader.tex}\n"
"#+STARTUP: showeverything\n"
"#+OPTIONS: toc:nil\n")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(define-skeleton org-wiki-entry
"Skeleton for articles "
"Preamble:"
"#+STARTUP: showeverything\n"
"#+TITLE: "_"\n"
"#+AUTHOR: Matheus Augusto da Silva\n"
"#+STARTUP: showeverything\n"
"\n"
"* Index")
#+END_SRC

#+BEGIN_SRC emacs-lisp
(define-skeleton org-wiki-index
"Skeleton for articles "
"Preamble:"
"#+STARTUP: showeverything\n"
"#+TITLE: "_"\n"
"#+AUTHOR: Matheus Augusto da Silva\n"
"#+STARTUP: showeverything\n"
"\n"
"* Index\n"
"\n"
"** Summaries\n"
"[[./summaries/summaries.org][Summaries]]"
)
#+END_SRC

* Language Related
 #+BEGIN_SRC emacs-lisp
 ;; This requires SDCV
 ;; This little function looks in a stardict file for words that look like
 ;; the word under the cursor. I use it when correcting my spelling in french
(use-package unicode-fonts :ensure t)
(defun dict-search ()
  (interactive)
  (add-hook 'comint-output-filter-functions 'comint-watch-for-password-prompt)
  (shell-command (format "export STARDICT_DATA_DIR=/home/alkhaldieid/Documents/Stardict ;sdcv -0  %s | sed -n 6p" (thing-at-point 'word))))

(define-key evil-normal-state-map (kbd "t") 'ispell-word)
(define-key evil-normal-state-map (kbd "T") 'dict-search)

 #+END_SRC

 #+RESULTS:
 : dict-search

* spacemacs compatiblity
** deft
#+BEGIN_SRC emacs-lisp
(use-package deft
  :commands deft
  :init
  (setq deft-default-extension "org"
        ;; de-couples filename and note title:
        deft-use-filename-as-title nil
        deft-use-filter-string-for-filename t
        ;; disable auto-save
        deft-auto-save-interval -1.0
        ;; converts the filter string into a readable file-name using kebab-case:
        deft-file-naming-rules
        '((noslash . "-")
          (nospace . "-")
          (case-fn . downcase)))
  :config
  (add-to-list 'deft-extensions "tex")
  )

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;;;;;;;;;;;;;;;;; open with configs;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (openwith-mode t)
  (setq openwith-associations '(("\\.pdf\\'" "zathura" (file))
                                ("\\.mp4\\'" "mpv" (file))
                                ))
#+END_SRC

#+RESULTS:

** openwith
#+BEGIN_SRC emacs-lisp
(use-package openwith :ensure t)
#+END_SRC

#+RESULTS:

* org-capture
#+BEGIN_SRC emacs-lisp

 ; https://cestlaz.github.io/posts/using-emacs-24-capture-2/
 ; Bind Key to: emacsclient -ne "(make-capture-frame)"
 
 (defadvice org-capture-finalize 
     (after delete-capture-frame activate)
   "Advise capture-finalize to close the frame"
   (if (equal "capture" (frame-parameter nil 'name))
       (delete-frame)))
 
 (defadvice org-capture-destroy
     (after delete-capture-frame activate)
   "Advise capture-destroy to close the frame"
   (if (equal "capture" (frame-parameter nil 'name))
       (delete-frame)))

 (use-package noflet
    :ensure t )
 (defun make-capture-frame ()
   "Create a new frame and run org-capture."
   (interactive)
   (make-frame '((name . "capture")))
   (select-frame-by-name "capture")
   (delete-other-windows)
   (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
           (org-capture)))
#+END_SRC

#+RESULTS:
: make-capture-frame

* presentations
#+BEGIN_SRC emacs-lisp

(add-to-list 'load-path "~/repos/org-reveal/")

   
(setq org-reveal-root "file:///home/alkhaldieid/repos/reveal.js")
#+END_SRC

#+RESULTS:
: file:///home/alkhaldieid/repos/reveal.js

* prose utils
translation, synonyms and other useful tools needed for writing efficiency. 
#+BEGIN_SRC emacs-lisp

#+END_SRC 
* Evil Leader Keybindings
#+BEGIN_SRC emacs-lisp
  ;; set the leader key
  (evil-leader/set-leader "<SPC>")
  ;; use (evil-leader/set-key to bind keys in the leader map
#+END_SRC
