README.org
** Global leader map
#+BEGIN_SRC emacs-lisp
  (evil-leader/set-key
    "<SPC> " 'counsel-M-x
    "fs" 'save-buffer
    "ff" 'counsel-find-file


    ;; buffers

    "bb" 'switch-to-buffer
    "bd" 'kill-buffer
    "bp" 'previous-buffer
    "bn" 'next-buffer
    ;; windows
    "wl" 'evil-window-right
    "wh" 'evil-window-left
    "wk" 'evil-window-up
    "wj" 'evil-window-down
    "wd" 'evil-window-delete
    "wv" 'evil-window-vsplit
    "ws" 'evil-window-split
    "wm" 'delete-other-windows

    ;; workspaces
    "lw1" 'eyebrowse-switch-to-window-config-1
    "lw2" 'eyebrowse-switch-to-window-config-2
    "lw3" 'eyebrowse-switch-to-window-config-3
    "lw4" 'eyebrowse-switch-to-window-config-4
    "lw5" 'eyebrowse-switch-to-window-config-5
    "lw6" 'eyebrowse-switch-to-window-config-6
    "lw7" 'eyebrowse-switch-to-window-config-7
    "lw8" 'eyebrowse-switch-to-window-config-8
    "lw9" 'eyebrowse-switch-to-window-config-9

    ;; evil-nerd-commenter
    "ci" 'evilnc-comment-or-uncomment-lines
    "cl" 'evilnc-quick-comment-or-uncomment-to-the-line
    "cc" 'evilnc-copy-and-comment-lines
    "cp" 'evilnc-comment-or-uncomment-paragraphs
    "cr" 'comment-or-uncomment-region
    "cv" 'evilnc-toggle-invert-comment-line-by-line
    "."  'evilnc-copy-and-comment-operator
    ";;" 'evilnc-comment-operator ; if you prefer backslash key

    ;; zoom-in and out
    "=" 'text-scale-increase
    "-" 'text-scale-decrease

    ;; org roam
    "nl" 'org-roam
    "nf" 'org-roam-find-file
    "ng" 'org-roam-show-graph
    "ni" 'org-roam-insert
    "nt" 'org-roam-dailies-find-today
    ;; org-roam-bibtex
    "na" 'orb-note-actions
    ;; syn layer  keybindings
    "ss" 'synonyms
    "sl" 'synosaurus-lookup
    "sr" 'synosaurus-choose-and-replace
    "si" 'synosaurus-choose-and-insert
    ;; org-recoll keys
    "ps" 'org-recoll-search
    "pu" 'org-recoll-update-index
    ;; evil-commentry
    ;; ";" evil-commentry-line
    ;; bookmarks 

    ;; work files
    "ow1" '(lambda() (interactive) (find-file "~/Dropbox/finalV/first/ijcst.tex"))
    "ow2" '(lambda() (interactive) (find-file "~/Dropbox/second_final/paper.org"))
    "ow3" '(lambda() (interactive) (find-file "~/Dropbox/third/paper.org"))
    "ow4" '(lambda() (interactive) (find-file "~/Dropbox/four/paper.org"))
    "owp" '(lambda() (interactive) (find-file "~/Dropbox/proposal/myproposal/Proposal and Thesis/lab/uthesis12/paper1.org"))
    "owc" '(lambda() (interactive) (find-file "~/Dropbox/conference/paper.org"))
    "owa" '(lambda() (interactive) (find-file
                                    "/home/alkhaldieid/Dropbox/LaTex/abstract.tex"))
    "oot" '(lambda() (interactive) (find-file "~/Dropbox/org/agenda/TODOs.org"))
    "oor" '(lambda() (interactive) (find-file "~/Dropbox/org/agenda/routine.org"))
    "ooo" '(lambda() (interactive) (find-file "~/Dropbox/org/notes/org-mode.org"))
    "ool" '(lambda() (interactive) (find-file "~/repos/shared/layers.org"))

    ;; cf files
    "cfe" '(lambda() (interactive) (find-file "~/.emacs.d/README.org"))
    "cfi" '(lambda() (interactive) (find-file "~/.config/i3/config"))
    "cfa" '(lambda() (interactive) (find-file "~/.config/aliasrc"))
    "cfd" '(lambda() (interactive) (find-file "~/.config/directories"))
    "cfm" '(lambda() (interactive) (find-file "~/.emacs.d/myinit.org"))

    ;; emacs quitting
    "qs" 'save-buffers-kill-emacs

    )
#+END_SRC

#+RESULTS:

** orgmode leader map
#+BEGIN_SRC emacs-lisp
(evil-leader/set-key-for-mode 'org-mode 
    "e" 'org-set-effort)
#+END_SRC

* What are the most important things to setup in my build  
** note taking

** org mode and its keybindings
** org agenda 
** org dispacher
** latex
** translating and synonyms on the fly
** ivy + swiper instead of helm
** python IDE
** Ein
** auto-completion for python 
