README.el
 "ff" 'counsel-find-file


 "d"'(lambda() (interactive) (find-file "~/Dropbox/second_final/ieee"))
 ;; buffers

 "bb" 'switch-to-buffer
 "bk" 'kill-buffer
 "bp" 'previous-buffer
 "bn" 'next-buffer
 ;; windows
 "wl" 'evil-window-right
 "wh" 'evil-window-left
 "wk" 'evil-window-up
 "wj" 'evil-window-down
 "wd" 'evil-window-delete
 "wv" 'evil-window-vsplit
 "ws" 'evil-window-split
 "wm" 'delete-other-windows

 ;; workspaces
 "lw1" 'eyebrowse-switch-to-window-config-1
 "lw2" 'eyebrowse-switch-to-window-config-2
 "lw3" 'eyebrowse-switch-to-window-config-3
 "lw4" 'eyebrowse-switch-to-window-config-4
 "lw5" 'eyebrowse-switch-to-window-config-5
 "lw6" 'eyebrowse-switch-to-window-config-6
 "lw7" 'eyebrowse-switch-to-window-config-7
 "lw8" 'eyebrowse-switch-to-window-config-8
 "lw9" 'eyebrowse-switch-to-window-config-9
 ;; files
 ;; cf files
 "cfe" '(lambda() (interactive) (find-file "~/.emacs.d/init.el"))
 "cfi" '(lambda() (interactive) (find-file "~/.config/i3/config"))
 "cfa" '(lambda() (interactive) (find-file "~/.config/aliasrc"))
 "cfd" '(lambda() (interactive) (find-file "~/.config/directories"))
 "cfk" '(lambda() (interactive) (find-file "~/.emacs.d/userConfig/keybindings.el"))
 "cfm" '(lambda() (interactive) (find-file "~/.emacs.d/myinit.org"))

 ;; evil-nerd-commenter
 "ci" 'evilnc-comment-or-uncomment-lines
 "cl" 'evilnc-quick-comment-or-uncomment-to-the-line
 "cc" 'evilnc-copy-and-comment-lines
 "cp" 'evilnc-comment-or-uncomment-paragraphs
 "cr" 'comment-or-uncomment-region
 "cv" 'evilnc-toggle-invert-comment-line-by-line
 "."  'evilnc-copy-and-comment-operator
 "//" 'evilnc-comment-operator ; if you prefer backslash key

 ;; zoom-in and out
 "=" 'text-scale-increase
 "-" 'text-scale-decrease

 ;; org roam
 "nl" 'org-roam
 "nf" 'org-roam-find-file
 "ng" 'org-roam-show-graph
 "ni" 'org-roam-insert
 "nt" 'org-roam-dailies-find-today
 ;; org-roam-bibtex
 "na" 'orb-note-actions
 ;; syn layer  keybindings
 "ss" 'synonyms
 "sl" 'synosaurus-lookup
 "sr" 'synosaurus-choose-and-replace
 "si" 'synosaurus-choose-and-insert
 ;; org-recoll keys
 "ps" 'org-recoll-search
 "pu" 'org-recoll-update-index
 ;; evil-commentry
;; ";" evil-commentry-line
 )
